[Killed] Equality mutation
DominoSet.cs:17:23
       _MaxEndValue = MaxEndValue;
 
       int j = 0;
-      for (int i = 0; i <= _MaxEndValue; i++)
+      for (int i = 0; i < _MaxEndValue; i++)
       {
         while (j <= _MaxEndValue)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
DominoSet.cs:17:42
       _MaxEndValue = MaxEndValue;
 
       int j = 0;
-      for (int i = 0; i <= _MaxEndValue; i++)
+      for (int i = 0; i <= _MaxEndValue; i--)
       {
         while (j <= _MaxEndValue)

[Killed] Negate expression
DominoSet.cs:19:16
       int j = 0;
       for (int i = 0; i <= _MaxEndValue; i++)
       {
-        while (j <= _MaxEndValue)
+        while (!(j <= _MaxEndValue))
         {
           Tile tile = new Tile(i, j);

[Killed] Equality mutation
DominoSet.cs:19:16
       int j = 0;
       for (int i = 0; i <= _MaxEndValue; i++)
       {
-        while (j <= _MaxEndValue)
+        while (j > _MaxEndValue)
         {
           Tile tile = new Tile(i, j);

[Killed] PostIncrementExpression to PostDecrementExpression mutation
DominoSet.cs:23:11
         {
           Tile tile = new Tile(i, j);
           _TileSet.Add(tile);
-          j++;
+                    j--;
         }
         j = i + 1;

[Killed] Arithmetic mutation
DominoSet.cs:25:13
           _TileSet.Add(tile);
           j++;
         }
-        j = i + 1;
+        j = i - 1;
       }
     }
