[Killed] Boolean mutation
Stock.cs:11:29
   {
     private static Random randomGenerator = new Random(0);
 
-    private bool _FullSet = false;
+    private bool _FullSet = true;
 
     private int _MaxEndValue = int.MinValue;

[Survived] Boolean mutation
Stock.cs:22:18
     public Stock(DominoSet dominoSet)
     {
       _TileList = dominoSet.Tiles;
-      _FullSet = true;
+      _FullSet = false;
       _MaxEndValue = dominoSet.MaxEndValue;
     }

[Killed] Negate expression
Stock.cs:35:11
     {
       int combinations;
       int doubles;
-      if (_MaxEndValue >= 0)
+      if (!(_MaxEndValue >= 0))
       {
         doubles = _MaxEndValue + 1;

[Killed] Equality mutation
Stock.cs:35:11
     {
       int combinations;
       int doubles;
-      if (_MaxEndValue >= 0)
+      if (_MaxEndValue < 0)
       {
         doubles = _MaxEndValue + 1;

[Killed] Arithmetic mutation
Stock.cs:37:19
       int doubles;
       if (_MaxEndValue >= 0)
       {
-        doubles = _MaxEndValue + 1;
+        doubles = _MaxEndValue - 1;
         combinations = factorial(_MaxEndValue + 1) / (factorial(2) * factorial(_MaxEndValue + 1 - 2));
         return combinations + doubles;

[Killed] Arithmetic mutation
Stock.cs:38:24
       if (_MaxEndValue >= 0)
       {
         doubles = _MaxEndValue + 1;
-        combinations = factorial(_MaxEndValue + 1) / (factorial(2) * factorial(_MaxEndValue + 1 - 2));
+        combinations = factorial(_MaxEndValue + 1) * (factorial(2) * factorial(_MaxEndValue + 1 - 2));
         return combinations + doubles;
       }

[Killed] Arithmetic mutation
Stock.cs:38:80
       if (_MaxEndValue >= 0)
       {
         doubles = _MaxEndValue + 1;
-        combinations = factorial(_MaxEndValue + 1) / (factorial(2) * factorial(_MaxEndValue + 1 - 2));
+        combinations = factorial(_MaxEndValue + 1) / (factorial(2) * factorial(_MaxEndValue + 1 + 2));
         return combinations + doubles;
       }

[Killed] Arithmetic mutation
Stock.cs:39:16
       {
         doubles = _MaxEndValue + 1;
         combinations = factorial(_MaxEndValue + 1) / (factorial(2) * factorial(_MaxEndValue + 1 - 2));
-        return combinations + doubles;
+        return combinations - doubles;
       }
       else

[Killed] Equality mutation
Stock.cs:49:11
 
     public void AddTile(Tile tile)
     {
-      if (TileCount == 0 && tile != null)
+      if (TileCount != 0  && tile != null)
       {
         _MaxEndValue = Tile.MaxEndValue;

[Killed] Equality mutation
Stock.cs:49:29
 
     public void AddTile(Tile tile)
     {
-      if (TileCount == 0 && tile != null)
+      if (TileCount == 0 && tile == null)
       {
         _MaxEndValue = Tile.MaxEndValue;

[Killed] Equality mutation
Stock.cs:55:11
         _MaxNumberTiles = MaxNumberTiles();
       }
 
-      if (Tile.MaxEndValue != _MaxEndValue)
+      if (Tile.MaxEndValue == _MaxEndValue)
       {
         throw new InvalidOperationException($"Stock can't be formed of tiles from different domino sets.");

[Killed] Negate expression
Stock.cs:60:11
         throw new InvalidOperationException($"Stock can't be formed of tiles from different domino sets.");
       }
 
-      if (_FullSet)
+      if (!(_FullSet))
       {
         throw new InvalidOperationException($"Stock already contains a full domino set.");

[Killed] String mutation
Stock.cs:62:45
 
       if (_FullSet)
       {
-        throw new InvalidOperationException($"Stock already contains a full domino set.");
+        throw new InvalidOperationException($"");
       }
 

[Killed] Logical mutation
Stock.cs:67:13
 
       foreach (var item in _TileList)
       {
-        if (item.End1 == tile.End1 && item.End2 == tile.End2)
+        if (item.End1 == tile.End1 || item.End2 == tile.End2)
         {
           throw new InvalidOperationException($"A stock can't have repeated tiles.");

[Killed] Negate expression
Stock.cs:67:13
 
       foreach (var item in _TileList)
       {
-        if (item.End1 == tile.End1 && item.End2 == tile.End2)
+        if (!(item.End1 == tile.End1 && item.End2 == tile.End2))
         {
           throw new InvalidOperationException($"A stock can't have repeated tiles.");

[Killed] Equality mutation
Stock.cs:75:11
 
       _TileList.Add(tile);
 
-      if (_TileList.Count == _MaxNumberTiles)
+      if (_TileList.Count != _MaxNumberTiles)
       {
         _FullSet = true;

[Killed] Boolean mutation
Stock.cs:77:20
 
       if (_TileList.Count == _MaxNumberTiles)
       {
-        _FullSet = true;
+        _FullSet = false;
       }
 

[Killed] Negate expression
Stock.cs:85:11
     public Tile RandomTileRemoval()
     {
       var size = TileCount;
-      if (size > 0)
+      if (!(size > 0))
       {
         int index = randomGenerator.Next(size);

[Killed] Equality mutation
Stock.cs:85:11
     public Tile RandomTileRemoval()
     {
       var size = TileCount;
-      if (size > 0)
+      if (size < 0)
       {
         int index = randomGenerator.Next(size);
