[Killed] Equality mutation
Tile.cs:17:36
 
     public Tile(int End1, int End2)
     {
-      if (End1 > _MAX_END_VALUE || End2 > _MAX_END_VALUE)
+      if (End1 > _MAX_END_VALUE || End2 < _MAX_END_VALUE)
       {
         throw new InvalidOperationException($"Maximum end value is {_MAX_END_VALUE}");

[Killed] Equality mutation
Tile.cs:17:11
 
     public Tile(int End1, int End2)
     {
-      if (End1 > _MAX_END_VALUE || End2 > _MAX_END_VALUE)
+      if (End1 >= _MAX_END_VALUE  || End2 > _MAX_END_VALUE)
       {
         throw new InvalidOperationException($"Maximum end value is {_MAX_END_VALUE}");

[Killed] String mutation
Tile.cs:19:45
     {
       if (End1 > _MAX_END_VALUE || End2 > _MAX_END_VALUE)
       {
-        throw new InvalidOperationException($"Maximum end value is {_MAX_END_VALUE}");
+        throw new InvalidOperationException($"");
       }
 

[Killed] Equality mutation
Tile.cs:22:11
         throw new InvalidOperationException($"Maximum end value is {_MAX_END_VALUE}");
       }
 
-      if (End1 < 0 || End2 < 0)
+      if (End1 > 0  || End2 < 0)
       {
         throw new InvalidOperationException($"Negative values are not allowed.");

[Killed] Logical mutation
Tile.cs:22:11
         throw new InvalidOperationException($"Maximum end value is {_MAX_END_VALUE}");
       }
 
-      if (End1 < 0 || End2 < 0)
+      if (End1 < 0 && End2 < 0)
       {
         throw new InvalidOperationException($"Negative values are not allowed.");
