[Killed] Negate expression
Utils.cs:9:11
   {
     public static int factorial(int n)
     {
-      if (n < 0)
+      if (!(n < 0))
       {
         throw new ArgumentOutOfRangeException("There is no implementation of factorial of negative numbers.");

[Killed] Equality mutation
Utils.cs:9:11
   {
     public static int factorial(int n)
     {
-      if (n < 0)
+      if (n > 0)
       {
         throw new ArgumentOutOfRangeException("There is no implementation of factorial of negative numbers.");

[Killed] String mutation
Utils.cs:11:47
     {
       if (n < 0)
       {
-        throw new ArgumentOutOfRangeException("There is no implementation of factorial of negative numbers.");
+        throw new ArgumentOutOfRangeException("");
       }
       if (n == 0 || n == 1)

[Killed] Equality mutation
Utils.cs:13:11
       {
         throw new ArgumentOutOfRangeException("There is no implementation of factorial of negative numbers.");
       }
-      if (n == 0 || n == 1)
+      if (n != 0  || n == 1)
       {
         return 1;

[Killed] Negate expression
Utils.cs:13:11
       {
         throw new ArgumentOutOfRangeException("There is no implementation of factorial of negative numbers.");
       }
-      if (n == 0 || n == 1)
+      if (!(n == 0 || n == 1))
       {
         return 1;

[Killed] Arithmetic mutation
Utils.cs:19:16
       }
       else
       {
-        return n * factorial(n - 1);
+        return n / factorial(n - 1);
       }
     }

[Timeout] Arithmetic mutation
Utils.cs:19:30
       }
       else
       {
-        return n * factorial(n - 1);
+        return n * factorial(n + 1);
       }
     }

[Killed] Arithmetic mutation
Utils.cs:25:21
 
     public static int DominoSetSize(int MaxEndValue)
     {
-      int doubles = MaxEndValue + 1;
+      int doubles = MaxEndValue - 1;
       int combinations = factorial(MaxEndValue + 1) / (factorial(2) * factorial(MaxEndValue + 1 - 2));
       return doubles + combinations;

[Killed] Arithmetic mutation
Utils.cs:26:36
     public static int DominoSetSize(int MaxEndValue)
     {
       int doubles = MaxEndValue + 1;
-      int combinations = factorial(MaxEndValue + 1) / (factorial(2) * factorial(MaxEndValue + 1 - 2));
+      int combinations = factorial(MaxEndValue - 1) / (factorial(2) * factorial(MaxEndValue + 1 - 2));
       return doubles + combinations;
     }

[Killed] Arithmetic mutation
Utils.cs:26:26
     public static int DominoSetSize(int MaxEndValue)
     {
       int doubles = MaxEndValue + 1;
-      int combinations = factorial(MaxEndValue + 1) / (factorial(2) * factorial(MaxEndValue + 1 - 2));
+      int combinations = factorial(MaxEndValue + 1) * (factorial(2) * factorial(MaxEndValue + 1 - 2));
       return doubles + combinations;
     }

[Killed] Arithmetic mutation
Utils.cs:27:14
     {
       int doubles = MaxEndValue + 1;
       int combinations = factorial(MaxEndValue + 1) / (factorial(2) * factorial(MaxEndValue + 1 - 2));
-      return doubles + combinations;
+      return doubles - combinations;
     }
   }
